## Importing Pandas

In [3]:
import pandas as pd # importing pandas as pd
import numpy  as np # importing numpy as np

## Series

### Creating Pandas Series with Default Index

In [4]:
nums = [1, 2, 3, 4,5]
s = pd.Series(nums)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

### Creating Pandas Series with custom index

In [9]:
nums = [1,2,3,4,5]
s = pd.Series(nums, index=[10,20,30,40,50])
s

10    1
20    2
30    3
40    4
50    5
dtype: int64

In [10]:
fruits = ['Orange','Banana','Mango']
fruits = pd.Series(fruits, index=[1, 2, 3])
print(fruits)

1    Orange
2    Banana
3     Mango
dtype: object

### Creating Pandas Series from a Dictionary

In [16]:
dct = {'ID1': "Ammar Osman", "ID2": "Ahmed Ammar", "ID3": "Khadir Osman"}

Ids_names = pd.Series(dct)
Ids_names

ID1     Ammar Osman
ID2     Ahmed Ammar
ID3    Khadir Osman
dtype: object

### Creating a Constant Pandas Series

In [17]:
constant_series = pd.Series(10, index= [1,2,3,4,5,6,7,8,9,10])
constant_series

1     10
2     10
3     10
4     10
5     10
6     10
7     10
8     10
9     10
10    10
dtype: int64

### Creating a Pandas Series Using Linspace

In [20]:
series_with_linspace = pd.Series(np.linspace(0,10,5))
series_with_linspace

0     0.0
1     2.5
2     5.0
3     7.5
4    10.0
dtype: float64

## Dataframes 

Pandas data frames can be created in different ways.

### Creating DataFrames from List of Lists

In [24]:
list_of_lists = [["Ammar","99%" ,"pass"], ["Mram","200%","pass"], ["Khadir", "100%", "pass"]]

df_from_lists = pd.DataFrame(list_of_lists, columns= ["Names", "Grades", "Pass"])
df_from_lists

    Names Grades  Pass
0   Ammar    99%  pass
1    Mram   200%  pass
2  Khadir   100%  pass

### Creating DataFrame Using Dictionary

In [26]:
dictionary = {"Names": ["Ammar", "Mram", "Khadir"], "Grades": ["99%", "200%", "100%"], "Pass": ["Pass","Pass", "Pass"]}
df_from_dict = pd.DataFrame(dictionary)
df_from_dict

    Names Grades  Pass
0   Ammar    99%  Pass
1    Mram   200%  Pass
2  Khadir   100%  Pass

### Creating DataFrames from a List of Dictionaries

In [27]:
list_of_dicts = [
    {'Name': 'Asabeneh', 'Country': 'Finland', 'City': 'Helsinki'},
    {'Name': 'David', 'Country': 'UK', 'City': 'London'},
    {'Name': 'John', 'Country': 'Sweden', 'City': 'Stockholm'}]
df_from_ld = pd.DataFrame(list_of_dicts)
df_from_ld

       Name  Country       City
0  Asabeneh  Finland   Helsinki
1     David       UK     London
2      John   Sweden  Stockholm

## Reading CSV File Using Pandas

I will be setting my working directory

In [28]:
import os

In [ ]:
os.listdir(".") #means set the working dir here in this folder

['25_pandas..ipynb', '25_pandas.md', 'weight-height.csv']

creating a dataframe by reading the file

In [34]:
df_weight_hight = pd.read_csv("weight-height.csv")
df_weight_hight

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

### Data Exploration

In [37]:
# df_weight_hight.head()
df_weight_hight.tail()

      Gender     Height      Weight
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

In [38]:
df_weight_hight.shape

(10000, 3)

In [39]:
df_weight_hight.columns

Index(['Gender', 'Height', 'Weight'], dtype='object')

getting a specific column as a Series using the column key

In [40]:
Hights = df_weight_hight["Height"]
Hights

0       73.847017
1       68.781904
2       74.110105
3       71.730978
4       69.881796
          ...
9995    66.172652
9996    67.067155
9997    63.867992
9998    69.034243
9999    61.944246
Name: Height, Length: 10000, dtype: float64

In [50]:
Weights = df_weight_hight["Weight"]
Weights
# print(list(Weights))

0       241.893563
1       162.310473
2       212.740856
3       220.042470
4       206.349801
           ...
9995    136.777454
9996    170.867906
9997    128.475319
9998    163.852461
9999    113.649103
Name: Weight, Length: 10000, dtype: float64

In [46]:
len(Weights) == len(Hights)

True

In [ ]:
Hights.describe()
# or
df_weight_hight["Height"].describe()

count    10000.000000
mean        66.367560
std          3.847528
min         54.263133
25%         63.505620
50%         66.318070
75%         69.174262
max         78.998742
Name: Height, dtype: float64

In [49]:
#describe the whoole dataframe

df_weight_hight.describe()

             Height        Weight
count  10000.000000  10000.000000
mean      66.367560    161.440357
std        3.847528     32.108439
min       54.263133     64.700127
25%       63.505620    135.818051
50%       66.318070    161.212928
75%       69.174262    187.169525
max       78.998742    269.989699

### Modifying a DataFrame

In [68]:
data = [
    {"Name": "Asabeneh", "Country":"Finland","City":"Helsinki"},
    {"Name": "David", "Country":"UK","City":"London"},
    {"Name": "John", "Country":"Sweden","City":"Stockholm"}]
df_locations = pd.DataFrame(data)
df_locations

       Name  Country       City
0  Asabeneh  Finland   Helsinki
1     David       UK     London
2      John   Sweden  Stockholm

In [80]:
new_col = [74, 78, 69]
df_locations["whight"] = new_col
df_locations

       Name  Country       City  whight  Height
0  Asabeneh  Finland   Helsinki      74    1.73
1     David       UK     London      78    1.75
2      John   Sweden  Stockholm      69    1.69

In [81]:
heights = [173, 175, 169]
df_locations['Height'] = heights
df_locations

       Name  Country       City  whight  Height
0  Asabeneh  Finland   Helsinki      74     173
1     David       UK     London      78     175
2      John   Sweden  Stockholm      69     169

BMI(Body Mass Index) BMI is mass divided by height squared (in meters) - Weight/Height * Height.

In [82]:
# Making Heights cm --> m

df_locations["Height"] *= 0.01
df_locations

       Name  Country       City  whight  Height
0  Asabeneh  Finland   Helsinki      74    1.73
1     David       UK     London      78    1.75
2      John   Sweden  Stockholm      69    1.69

In [85]:
# creating BMI list to use it as colmun

def calculate_BMI(Weights, Hights):
    BMI = []
    print(Weights)
    for w, h in zip(Weights, Hights):
        # print("w is:", type(w))
        # print("h is: ", type(h))
        # I was getting type error becuse when I created
        # the weights col I made the numbers strings
        b = w / (h*h)
        BMI.append(b)
    
    return BMI

BMI = calculate_BMI( df_locations["whight"] ,df_locations["Height"])

0    74
1    78
2    69
Name: whight, dtype: int64

In [87]:
# Add the BMI column 

df_locations["BMI"] = BMI
df_locations

       Name  Country       City  whight  Height        BMI
0  Asabeneh  Finland   Helsinki      74    1.73  24.725183
1     David       UK     London      78    1.75  25.469388
2      John   Sweden  Stockholm      69    1.69  24.158818

In [88]:
# Round the BMI values

df_locations["BMI"] = round(df_locations["BMI"], 2)
df_locations

       Name  Country       City  whight  Height    BMI
0  Asabeneh  Finland   Helsinki      74    1.73  24.73
1     David       UK     London      78    1.75  25.47
2      John   Sweden  Stockholm      69    1.69  24.16

### Checking data types of Column values

In [91]:
# let's add birth year and current year

current_year = pd.Series(2025, index=[0, 1, 2])

birth_year = ['1769', '1985', '1990']

df_locations["Current Year"] = current_year
df_locations["Birth Year"] = birth_year
df_locations

,Name,Country,City,whight,Height,BMI,Current Year,Birth Year
0,Asabeneh,Finland,Helsinki,74,1.73,24.73,2025,1769
1,David,UK,London,78,1.75,25.47,2025,1985
2,John,Sweden,Stockholm,69,1.69,24.16,2025,1990

In [ ]:
df_locations["Height"].dtype
# Or
df_locations.Height.dtype

dtype('float64')

In [96]:
# if we check birth year --> str
df_locations["Birth Year"].dtype

dtype('O')

In [97]:
# let's change is to int type using .astype

df_locations["Birth Year"] = df_locations["Birth Year"].astype(int)
df_locations["Birth Year"].dtype

dtype('int32')

In [ ]:
df_locations["Current Year"].dtype # it is int 
#let's calculate age

dtype('int64')

In [99]:
ages = df_locations["Current Year"] - df_locations["Birth Year"]
ages

0    256
1     40
2     35
dtype: int64

In [100]:
df_locations["Age"] = ages
df_locations

,Name,Country,City,whight,Height,BMI,Current Year,Birth Year,Age
0,Asabeneh,Finland,Helsinki,74,1.73,24.73,2025,1769,256
1,David,UK,London,78,1.75,25.47,2025,1985,40
2,John,Sweden,Stockholm,69,1.69,24.16,2025,1990,35

In [101]:
# check if one lives above 120 years

df_locations[df_locations["Age"] > 120]

,Name,Country,City,whight,Height,BMI,Current Year,Birth Year,Age
0,Asabeneh,Finland,Helsinki,74,1.73,24.73,2025,1769,256

In [102]:
# calculte the mean ignoring typo error (>120 age)

mean = (40+35)/2
mean

37.5

## Exercises: Day 25

1. Read the hacker_news.csv file from data directory 
1. Get the first five rows
1. Get the last five rows
1. Get the title column as pandas series
1. Count the number of rows and columns
    - Filter the titles which contain python
    - Filter the titles which contain JavaScript
    - Explore the data and make sense of it

In [103]:
import pandas as pd 
import numpy as np

In [ ]:
# 1. Read the hacker_news.csv file from data directory
df = pd.read_csv("../data/hacker_news.csv")

df

,id,title,url,num_points,num_comments,author,created_at
0,12224879,Interactive Dynamic Video,http://www.interactivedynamicvideo.com/,386,52,ne0phyte,8/4/2016 11:52
1,11964716,Florida DJs May Face Felony for April Fools' W...,http://www.thewire.com/entertainment/2013/04/f...,2,1,vezycash,6/23/2016 22:20
2,11919867,Technology ventures: From Idea to Enterprise,https://www.amazon.com/Technology-Ventures-Ent...,3,1,hswarna,6/17/2016 0:01
3,10301696,Note by Note: The Making of Steinway L1037 (2007),http://www.nytimes.com/2007/11/07/movies/07ste...,8,2,walterbell,9/30/2015 4:12
4,10482257,Title II kills investment? Comcast and other I...,http://arstechnica.com/business/2015/10/comcas...,53,22,Deinos,10/31/2015 9:48
...,...,...,...,...,...,...,...
20094,12379592,How Purism Avoids Intels Active Management Tec...,https://puri.sm/philosophy/how-purism-avoids-i...,10,6,AdmiralAsshat,8/29/2016 2:22
20095,10339284,YC Application Translated and Broken Down,https://medium.com/@zreitano/the-yc-applicatio...,4,1,zreitano,10/6/2015 14:57
20096,10824382,Microkernels are slow and Elvis didn't do no d...,http://blog.darknedgy.net/technology/2016/01/0...,169,132,vezzy-fnord,1/2/2016 0:49
20097,10739875,How Product Hunt really works,https://medium.com/@benjiwheeler/how-product-h...,695,222,brw12,12/15/2015 19:32
20098,11680777,RoboBrowser: Your friendly neighborhood web sc...,https://github.com/jmcarp/robobrowser,182,58,pmoriarty,5/12/2016 1:43

In [ ]:
# 2. Get the first five rows

df.head(2)

,id,title,url,num_points,num_comments,author,created_at
0,12224879,Interactive Dynamic Video,http://www.interactivedynamicvideo.com/,386,52,ne0phyte,8/4/2016 11:52
1,11964716,Florida DJs May Face Felony for April Fools' W...,http://www.thewire.com/entertainment/2013/04/f...,2,1,vezycash,6/23/2016 22:20

In [111]:
# 3. Get the last five rows
df.tail(2)

,id,title,url,num_points,num_comments,author,created_at
20097,10739875,How Product Hunt really works,https://medium.com/@benjiwheeler/how-product-h...,695,222,brw12,12/15/2015 19:32
20098,11680777,RoboBrowser: Your friendly neighborhood web sc...,https://github.com/jmcarp/robobrowser,182,58,pmoriarty,5/12/2016 1:43

In [113]:
# 4. Get the title column as pandas series

titles = df["title"]
titles

0                                Interactive Dynamic Video
1        Florida DJs May Face Felony for April Fools' W...
2             Technology ventures: From Idea to Enterprise
3        Note by Note: The Making of Steinway L1037 (2007)
4        Title II kills investment? Comcast and other I...
                               ...
20094    How Purism Avoids Intels Active Management Tec...
20095            YC Application Translated and Broken Down
20096    Microkernels are slow and Elvis didn't do no d...
20097                        How Product Hunt really works
20098    RoboBrowser: Your friendly neighborhood web sc...
Name: title, Length: 20099, dtype: object

In [114]:
# 5. Count the number of rows and columns

df.shape

(20099, 7)

In [118]:
# Filter the titles which contain python

# df["pthon" in df["title"]]
df_py = df[df["title"].str.contains("python", case= False)]
df_py

,id,title,url,num_points,num_comments,author,created_at
102,10974870,From Python to Lua: Why We Switched,https://www.distelli.com/blog/using-lua-for-ou...,243,188,chase202,1/26/2016 18:17
103,11244541,Ubuntu 16.04 LTS to Ship Without Python 2,http://news.softpedia.com/news/ubuntu-16-04-lt...,2,1,_snydly,3/8/2016 10:39
144,10963528,Create a GUI Application Using Qt and Python i...,http://digitalpeer.com/s/c63e,21,1,zoodle,1/24/2016 19:01
196,10716331,How I Solved GCHQ's Xmas Card with Python and ...,http://matthewearl.github.io/2015/12/10/gchq-x...,6,1,kipi,12/11/2015 10:38
436,11895088,"Unikernel Power Comes to Java, Node.js, Go, an...",http://www.infoworld.com/article/3082051/open-...,3,1,syslandscape,6/13/2016 16:23
...,...,...,...,...,...,...,...
19597,12061177,David Beazley Python Concurrency from the Gro...,https://www.youtube.com/watch?v=MCs5OvhV9S4,2,1,bakery2k,7/9/2016 13:05
19852,10988468,Ask HN: How to automate Python apps deployment?,NaN,4,18,aalhour,1/28/2016 14:55
19862,11738470,Moving Away from Python 2,https://asmeurer.github.io/blog/posts/moving-a...,227,275,ngoldbaum,5/20/2016 15:14
19980,12524656,Python vs. Julia Observations,https://medium.com/@Jernfrost/python-vs-julia-...,2,1,blacksmythe,9/18/2016 9:54
19998,11735438,Show HN: Decorating: Animated pulsed for your ...,https://github.com/ryukinix/decorating,3,1,lerax,5/20/2016 3:48

In [119]:
# Filter the titles which contain JavaScript

df_Java = df[df["title"].str.contains("JavaScript", case= False)]
df_Java

,id,title,url,num_points,num_comments,author,created_at
267,12352636,Show HN: Hire JavaScript - Top JavaScript Talent,https://www.hirejs.com/,1,1,eibrahim,8/24/2016 15:16
580,10871330,Python integration for the Duktape Javascript ...,https://pypi.python.org/pypi/pyduktape,3,1,stefano,1/9/2016 14:26
811,10741251,Ask HN: Are there any projects or compilers wh...,NaN,1,2,ggonweb,12/15/2015 23:26
1046,11343334,"If you write JavaScript tools or libraries, bu...",https://medium.com/@Rich_Harris/how-to-not-bre...,48,19,callumlocke,3/23/2016 10:54
1093,10422726,Rollup.js: A next-generation JavaScript module...,http://rollupjs.org,57,17,dmmalam,10/21/2015 0:02
...,...,...,...,...,...,...,...
19349,11448301,"Fotorama, a responsive JavaScript photo gallery",http://fotorama.io/,1,1,alexkon,4/7/2016 15:59
19548,12105148,Another Kind of JavaScript Fatigue,http://chrismm.com/blog/the-other-kind-of-java...,9,2,JacksCracked,7/16/2016 3:44
19610,12203508,Lonely programmer detective uncovers the Mozil...,http://stackoverflow.com/a/38677222/984780,29,8,luisperezphd,8/1/2016 16:07
19885,12552131,Ask HN: Best Practices for CSS in a Modern Jav...,NaN,6,6,xwvvvvwx,9/21/2016 20:53
20069,12149183,Show HN: Parse recipe ingredients using JavaSc...,https://github.com/herkyl/ingredients-parser,6,2,zongitsrinzler,7/23/2016 11:35

In [ ]:
# Explore the data and make sense of it
# TODO